	ORG 050
	LDA 001             ;X的低位->A 
	MOV R0,A            ;(A)->R0
	LDA 002             ;Y的低位->A
	ADD A,R0            ;X低位+Y低位->A 有进位置CY=1，无进位置CY=0
	JC CARRY           ;有无进位？有进位则跳到CARRY,无进位则顺序执行
	;无进位 
	STA 005          ;(A)->005,X与Y的低位相加和送至005
	LDA 003          ;X的高位->A
	MOV R0,A        ;(A)->R0
	LDA 004         ;Y的高位->A
	ADD A,R0        ;X的高位+Y的高位->A
	STA 006          ;(A)->006,X与Y的高位相加结果送至006
;有进位
CARRY:
	STA 005          ;(A)->005,X与Y的低位相加和送至005
	LDA 003          ;X的高位->A
	MOV R0,A        ;(A)->R0
	LDA 004          ;Y的高位->A
	ADD A,R0        ;X的高位+Y的高位->A
	MOV R0,A        ;(A)->R0
	MOV A,#1        ;1->A
	ADD A,R0        ;X与Y的高位相加和再加上来自低位相加的进位1
	STA 006          ;(A)->006, X与Y的高位相加结果送至006
;功能：实现双字节加法
;结果X=34BE,Y=EE7F,运行程序后005中存储低位相加和3D,006存储高位相加和加低位进位23 
